/*--------------------------------------------------------------------------------------------------------------------
Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
--------------------------------------------------------------------------------------------------------------------*/

void PrintArray(int num)
{
    int[] x = new int[num];

    for(int i=0; i<num; i++)
    {
        x[i] = new Random().Next(0,2);
        Console.WriteLine($"x[{i}] = {x[i]}");
    }
}

int num = 8;
PrintArray(num);

